#+TITLE:     Ectorepo: support
#+AUTHOR:    David Conner
#+EMAIL:     noreply@te.xel.io
#+DESCRIPTION: notes
#+PROPERTY: header-args :mkdirp yes
#+PROPERTY: header-args:sh     :tangle-mode (identity #o555) :mkdirp yes
#+PROPERTY: header-args:python :tangle-mode (identity #o644) :mkdirp yes
#+PROPERTY: header-args:conf   :tangle-mode (identity #o444) :mkdirp yes
#+property: header-args:scheme :tangle-mode (identity #o644) :mkdirp yes

#+begin_src emacs-lisp :eval no :exports none :results none
;; Eval with C-x C-e to disable eval confirmation in this buffer
;; ... or set :eval yes
(setq-local org-confirm-babel-evaluate nil)
#+end_src

*** Shell Scripts

Grok the general directory structure with =tree -dL 3 .= after submodules have
been modulized

#+begin_src shell :results output :var repoproject="crypto" :dir /data/ecto
cd $repoproject
repo forall  -c 'echo $REPO_LREV $REPO_RREV $REPO_PATH $REPO_PROJECT' | head -n7

echo -n '' # idk. it just be like that sometimes
#+end_src

#+RESULTS:
: 78571a281eb251e75683b345025ed74f8b5c6c54 refs/tags/gnupg-2.2.50 gnupg/gnupg-2.2 gnupg
: 9d302f978bd718a7b477294c2f5b386bea6ca00d refs/heads/STABLE-BRANCH-2-4 gnupg/gnupg-2.4 gnupg
: b39a0298112de853cc7c0833ed1c366330a225ef refs/tags/gnupg-2.5.13 gnupg/gnupg-2.5 gnupg
: d0d9652e402ede5824204cf2a8595a89d8f3f9ff refs/heads/master go/go-ykpiv go-piv/go-ykpiv
: 5a76b44bb2ea34ea4b24a6e295fc0a234f5f0692 refs/heads/master go/piv-go go-piv/piv-go
: f380bc1c902b4dcd2a134eadabdd2ecc5a38e211 refs/heads/dev pki/fpkilint gsa/fpkilint
: 64bbb446efa71a64f5cc23a6be94e58b909a6681 refs/heads/main python/cryptography pyca/cryptography

Available environment variables

| ~REPO_PROJECT~   | unique name of the project                                                                    |
| ~REPO_PATH~      | path relative to client root                                                                  |
| ~REPO_OUTERPATH~ | sub manifest's root path relative to client root                                              |
| ~REPO_INNERPATH~ | path relative to root of sub manifest                                                         |
| ~REPO_REMOTE~    | name of the remote system from manifest.                                                      |
| ~REPO_LREV~      | revision from the manifest, translated to a local tracking branch                             |
| ~REPO_RREV~      | revision from the manifest, exactly as written in manifest.                                   |
| ~REPO_COUNT~     | total number of projects being iterated.                                                      |
| ~REPO_I~         | 1-based iteration count ~REPO_I / REPO_COUNT~ shows progress                                    |
| ~REPO__*~        | extra environment variables, specified by the "annotation" element under any project element. |

+ use =REPO_LREV= if you need to pass the manifest revision to a locally executed
  git command
+ =REPO__*= can be useful for differentiating trees based on user-specific
  criteria, or simply annotating tree details

****** Misc

Which one sticks out?

#+begin_src shell :results output code :wrap example diff
diff <(find . -mindepth 2 -name "default.xml" | sort | cut -f2- -d'/') \
    <(grep -re _remotes.xml --include="default.xml" * | sort | cut -f1 -d':')
echo
#+end_src

#+RESULTS:
#+begin_example diff
4d3
< basic-sec/default.xml

#+end_example

**** Old Merge =_remotes.xml= Manifests

I'm not sure how to merge patches while dropping file source info. This just
finds and reports all lines not in the top-level manifest.

#+begin_src shell :results output
allremotes=_remotes.xml
subremotes=(*/_remotes.xml)

mergedir=$(mktemp -d)

echo $mergedir

for remote in "${subremotes[@]}";do
    remotename=$(dirname $remote)
    #echo "diff $allremotes $remote > remote.diff"
    diff $allremotes $remote > $mergedir/$remotename.xml
done

cat $mergedir/* | grep -e "^>\s*<remote" | sort | uniq | cut -b2-
#+end_src

#+RESULTS:
#+begin_example
/tmp/tmp.6eUYYdLkTz
   <remote name="framagit" fetch="https://framagit.org"/>
   <remote name="github" fetch="https://github.com"/>
   <remote name="srht_abcdw" fetch="https://git.sr.ht/~abcdw"/>
   <remote name="srht_akagi" fetch="https://git.sr.ht/~akagi"/>
   <remote name="srht_krevedkokun" fetch="https://git.sr.ht/~krevedkokun"/>
   <remote name="srht_michal_atlas" fetch="https://git.sr.ht/~michal_atlas"/>
   <remote name="srht_plattfot" fetch="https://git.sr.ht/~plattfot"/>
   <remote name="srht_sircmpwn" fetch="https://git.sr.ht/~sircmpwn"/>
   <remote name="srht_whereiseveryone" fetch="https://git.sr.ht/~whereiseveryone"/>
#+end_example

*** Fix misbehaving checkouts

Running =repo sync= and cloning too many bundles at once ends up not updating
the =pwd= with checkouts, which makes running manual =repo sync $project= a bit
difficult.

#+name: superproject
#+begin_src emacs-lisp :results replace value
"tensorflow"
#+end_src

#+name: superinclude
#+begin_src emacs-lisp :results replace value
"tensorflow_core.xml"
#+end_src

#+name: projects
#+header:  :var superproject=superproject superinclude=superinclude
#+begin_src sh :results replace output
grep -e '<project' $_REPO/$superproject/$superinclude | sed -E 's/^.*path="(.*)" ref=".*$/\1/'
#+end_src

#+RESULTS: projects
#+begin_example
.allstar
adanet
addons
agents
benchmarks
build
cloud
codelabs
community
compression
custom-op
data-validation
datasets
decision-forests
deepmath
docs
docs-l10n
dtensor-gcp-examples
ecosystem
embedding-projector-standalone
estimator
examples
fairness-indicators
federated
fold
gan
gnn
graphics
haskell
hub
io
java
java-models
java-ndarray
kfac
lattice
lingvo
lucid
mesh
metadata
mlir-hlo
model-analysis
model-card-toolkit
model-optimization
model-remediation
models
networking
neural-structured-learning
nmt
oss-fuzz
playground
privacy
probability
profiler
profiler-ui
quantum
ranking
recommenders
recommenders-addons
runtime
rust
serving
sig-tfjs
similarity
swift-apis
tcav
tensor2tensor
tensorboard
tensorflow
tensorrt
text
tf-build-actions
tfhub.dev
tfjs
tfjs-examples
tfjs-models
tfjs-website
tfjs-wechat
tflite-micro
tflite-micro-arduino-examples
tflite-support
tfx
tfx-addons
tfx-bsl
toolchains
tpu
transform
#+end_example

